package com.zoufanqi.crypt;

/**
 * @author zoufanqi
 * @version v1.0
 * @since 2023/2/7 18:17
 **/
public class SecretData {
    public final static String DATA1 = "外交部发言人毛宁7日主持例行记者会。有记者提问说，美国安全委员会发言人约翰·柯比昨天说，没有计划将气球的碎片和设备归还给中国，那么中方是否对美国提出过或者打算提出相关的要求？\n" +
            "毛宁表示，这个飞艇不是美国的，是中国的。中国政府将继续坚决维护自身的正当合法权益。\n" +
            "毛宁说，关于这个飞艇，我们说过很多次了。我想强调的是，首先中国的无人飞艇是民用性质，完全是因为不可抗力误入了美国的领空，这是个意外事件，没有对美方的人员和国家安全构成威胁。对于这一类的事件，美方本来应当以冷静、专业、非武力的方式妥善处理，但是美方执意动用武力明显是反应过度。";

    public final static String DATA2 = "外交部发言人毛宁7日主持例行记者会。有记者提问说，美国安全委员会发言人约翰·柯比昨天说，没有计划将气球的碎片和设备归还给中国，那么中方是否对美国提出过或者打算提出相关的要求？\n" +
            "毛宁表示，这个飞艇不是美国的，是中国的。中国政府将继续坚决维护自身的正当合法权益。\n" +
            "毛宁说，关于这个飞艇，我们说过很多次了。我想强调的是，首先中国的无人飞艇是民用性质，完全是因为不可抗力误入了美国的领空，这是个意外事件，没有对美方的人员和国家安全构成威胁。对于这一类的事件，美方本来应当以冷静、专业、非武力的方式妥善处理，但是美方执意动用武力明显是反应过度。" +
            "外交部发言人毛宁7日主持例行记者会。有记者提问说，美国安全委员会发言人约翰·柯比昨天说，没有计划将气球的碎片和设备归还给中国，那么中方是否对美国提出过或者打算提出相关的要求？\n" +
            "毛宁表示，这个飞艇不是美国的，是中国的。中国政府将继续坚决维护自身的正当合法权益。\n" +
            "毛宁说，关于这个飞艇，我们说过很多次了。我想强调的是，首先中国的无人飞艇是民用性质，完全是因为不可抗力误入了美国的领空，这是个意外事件，没有对美方的人员和国家安全构成威胁。对于这一类的事件，美方本来应当以冷静、专业、非武力的方式妥善处理，但是美方执意动用武力明显是反应过度。" +
            "外交部发言人毛宁7日主持例行记者会。有记者提问说，美国安全委员会发言人约翰·柯比昨天说，没有计划将气球的碎片和设备归还给中国，那么中方是否对美国提出过或者打算提出相关的要求？\n" +
            "毛宁表示，这个飞艇不是美国的，是中国的。中国政府将继续坚决维护自身的正当合法权益。\n" +
            "毛宁说，关于这个飞艇，我们说过很多次了。我想强调的是，首先中国的无人飞艇是民用性质，完全是因为不可抗力误入了美国的领空，这是个意外事件，没有对美方的人员和国家安全构成威胁。对于这一类的事件，美方本来应当以冷静、专业、非武力的方式妥善处理，但是美方执意动用武力明显是反应过度。" +
            "外交部发言人毛宁7日主持例行记者会。有记者提问说，美国安全委员会发言人约翰·柯比昨天说，没有计划将气球的碎片和设备归还给中国，那么中方是否对美国提出过或者打算提出相关的要求？\n" +
            "毛宁表示，这个飞艇不是美国的，是中国的。中国政府将继续坚决维护自身的正当合法权益。\n" +
            "毛宁说，关于这个飞艇，我们说过很多次了。我想强调的是，首先中国的无人飞艇是民用性质，完全是因为不可抗力误入了美国的领空，这是个意外事件，没有对美方的人员和国家安全构成威胁。对于这一类的事件，美方本来应当以冷静、专业、非武力的方式妥善处理，但是美方执意动用武力明显是反应过度。" +
            "外交部发言人毛宁7日主持例行记者会。有记者提问说，美国安全委员会发言人约翰·柯比昨天说，没有计划将气球的碎片和设备归还给中国，那么中方是否对美国提出过或者打算提出相关的要求？\n" +
            "毛宁表示，这个飞艇不是美国的，是中国的。中国政府将继续坚决维护自身的正当合法权益。\n" +
            "毛宁说，关于这个飞艇，我们说过很多次了。我想强调的是，首先中国的无人飞艇是民用性质，完全是因为不可抗力误入了美国的领空，这是个意外事件，没有对美方的人员和国家安全构成威胁。对于这一类的事件，美方本来应当以冷静、专业、非武力的方式妥善处理，但是美方执意动用武力明显是反应过度。" +
            "外交部发言人毛宁7日主持例行记者会。有记者提问说，美国安全委员会发言人约翰·柯比昨天说，没有计划将气球的碎片和设备归还给中国，那么中方是否对美国提出过或者打算提出相关的要求？\n" +
            "毛宁表示，这个飞艇不是美国的，是中国的。中国政府将继续坚决维护自身的正当合法权益。\n" +
            "毛宁说，关于这个飞艇，我们说过很多次了。我想强调的是，首先中国的无人飞艇是民用性质，完全是因为不可抗力误入了美国的领空，这是个意外事件，没有对美方的人员和国家安全构成威胁。对于这一类的事件，美方本来应当以冷静、专业、非武力的方式妥善处理，但是美方执意动用武力明显是反应过度。" +
            "外交部发言人毛宁7日主持例行记者会。有记者提问说，美国安全委员会发言人约翰·柯比昨天说，没有计划将气球的碎片和设备归还给中国，那么中方是否对美国提出过或者打算提出相关的要求？\n" +
            "毛宁表示，这个飞艇不是美国的，是中国的。中国政府将继续坚决维护自身的正当合法权益。\n" +
            "毛宁说，关于这个飞艇，我们说过很多次了。我想强调的是，首先中国的无人飞艇是民用性质，完全是因为不可抗力误入了美国的领空，这是个意外事件，没有对美方的人员和国家安全构成威胁。对于这一类的事件，美方本来应当以冷静、专业、非武力的方式妥善处理，但是美方执意动用武力明显是反应过度。" +
            "外交部发言人毛宁7日主持例行记者会。有记者提问说，美国安全委员会发言人约翰·柯比昨天说，没有计划将气球的碎片和设备归还给中国，那么中方是否对美国提出过或者打算提出相关的要求？\n" +
            "毛宁表示，这个飞艇不是美国的，是中国的。中国政府将继续坚决维护自身的正当合法权益。\n" +
            "毛宁说，关于这个飞艇，我们说过很多次了。我想强调的是，首先中国的无人飞艇是民用性质，完全是因为不可抗力误入了美国的领空，这是个意外事件，没有对美方的人员和国家安全构成威胁。对于这一类的事件，美方本来应当以冷静、专业、非武力的方式妥善处理，但是美方执意动用武力明显是反应过度。" +
            "外交部发言人毛宁7日主持例行记者会。有记者提问说，美国安全委员会发言人约翰·柯比昨天说，没有计划将气球的碎片和设备归还给中国，那么中方是否对美国提出过或者打算提出相关的要求？\n" +
            "毛宁表示，这个飞艇不是美国的，是中国的。中国政府将继续坚决维护自身的正当合法权益。\n" +
            "毛宁说，关于这个飞艇，我们说过很多次了。我想强调的是，首先中国的无人飞艇是民用性质，完全是因为不可抗力误入了美国的领空，这是个意外事件，没有对美方的人员和国家安全构成威胁。对于这一类的事件，美方本来应当以冷静、专业、非武力的方式妥善处理，但是美方执意动用武力明显是反应过度。";
}
